from PIL import Image
from PIL import ImageEnhance
import cv2

# 8-8　图像美白算法设计示例，通过颜色查找表
def main():
    img = cv2.imread('..\c3.jpg')
    img = cv2.bilateralFilter(img, 9, 75, 75)
    height, width, n = img.shape
    img2 = img.copy()
    #color_list = list(range(1, 257))
    #color_list = [i for i in range(1, 257)] #列表推导式
    # print(color_list)
    '''建立一个查找表，共包含256个元素，每一个元素对应一个0～255
    像素值调整后的像素，一般是对原本的像素值增加'''
    color_list = [
        1, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 31, 33, 35, 37, 39,
        41, 43, 44, 46, 48, 50, 52, 53, 55, 57, 59, 60, 62, 64, 66, 67, 69, 71, 73, 74,
        76, 78, 79, 81, 83, 84, 86, 87, 89, 91, 92, 94, 95, 97, 99, 100, 102, 103, 105,
        106, 108, 109, 111, 112, 114, 115, 117, 118, 120, 121, 123, 124, 126, 127, 128,
        130, 131, 133, 134, 135, 137, 138, 139, 141, 142, 143, 145, 146, 147, 149, 150,
        151, 153, 154, 155, 156, 158, 159, 160, 161, 162, 164, 165, 166, 167, 168, 170,
        171, 172, 173, 174, 175, 176, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187,
        188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203,
        204, 205, 205, 206, 207, 208, 209, 210, 211, 211, 212, 213, 214, 215, 215, 216,
        217, 218, 219, 219, 220, 221, 222, 222, 223, 224, 224, 225, 226, 226, 227, 228,
        228, 229, 230, 230, 231, 232, 232, 233, 233, 234, 235, 235, 236, 236, 237, 237,
        238, 238, 239, 239, 240, 240, 241, 241, 242, 242, 243, 243, 244, 244, 244, 245,
        245, 246, 246, 246, 247, 247, 248, 248, 248, 249, 249, 249, 250, 250, 250, 250,
        251, 251, 251, 251, 252, 252, 252, 252, 253, 253, 253, 253, 253, 254, 254, 254,
        254, 254, 254, 254, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255,
        255, 255, 255, 256]

    for i in range(height):
        for j in range(width):
            b = img2[i, j][0]
            g = img2[i, j][1]
            r = img2[i, j][2]
            img2[i, j][0] = color_list[b]
            img2[i, j][1] = color_list[g]
            img2[i, j][2] = color_list[r]
    cv2.imwrite('res_white41.jpg', img2)
    img3 = Image.open('res_white41.jpg')
    # 对比度增强
    enh_con = ImageEnhance.Contrast(img3)
    contrast = 1.1
    img_contrasted = enh_con.enhance(contrast)
    # 亮度增强
    enh_bri = ImageEnhance.Brightness(img_contrasted)
    brightness = 1.1
    img_brightened = enh_bri.enhance(brightness)
    img_brightened.show()
    img_brightened.save("res_white42.jpg")

if __name__ == '__main__':
    main()
